_protected/models/UcesnikRadiNaZadatkuQuery.php

SELECT * FROM `ucesnik_radi_na_zadatku` WHERE 0=1
---
    public function all($db = null)
    {
        return parent::all($db);