_protected/models/UcesnikRadiNaProjektuQuery.php

    public function all($db = null)
    {
        return parent::all($db);
---
SELECT * FROM `ucesnik_radi_na_projektu` WHERE 0=1