_protected/models/VrstaUcesnikaQuery.php

    public function all($db = null)
    {
        return parent::all($db);
---
SELECT * FROM `vrsta_ucesnika` ORDER BY `id`